tutorials/cases/posterDemo-woodGrad/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// ── Three-layer packed bed for GRC poster showcase ─────────────────────
// The bed is initialised with three z-layers of different porosity.  The
// porosity gradient gives the Us field (from gravity-driven DEM settlement)
// something to advect, making the PGF↔DEM coupling visible.
//
// Layer 1  bottom  z = 0.000 → 0.032  — loose packing  (porosityF 0.55)
// Layer 2  middle  z = 0.032 → 0.064  — medium packing (porosityF 0.40)
// Layer 3  top     z = 0.064 → 0.096  — densest packing (porosityF 0.30)
//
// All layers start at 800 K so chemistry fires immediately everywhere.
// An initial Ychar gradient is imposed via setExprFieldsDict: bottom 70 %
// converted, top fresh wood — creating a striking bottom→top conversion
// gradient visible in sphere radii from t=0.
//
// YADE packs hexagonal spheres in three y-layers (see MPI_lambda.py).
// Boxes span the full y-width (0.018 m) of the 1-cell-thick 2.5D mesh.

defaultFieldValues
(
    volScalarFieldValue porosityF  1.0
    volScalarFieldValue porosityF0 1.0
    volScalarFieldValue Ywood      1.0
    volScalarFieldValue Ychar      0.0
);

regions
(
    // Layer 1 — bottom: loose packing
    boxToCell
    {
        box (0 0 0) (0.04 0.018 0.032);
        fieldValues
        (
            volScalarFieldValue porosityF  0.55
            volScalarFieldValue porosityF0 0.55
            volScalarFieldValue Ts         800
            volScalarFieldValue T          800
        );
    }

    // Layer 2 — middle: medium packing
    boxToCell
    {
        box (0 0 0.032) (0.04 0.018 0.064);
        fieldValues
        (
            volScalarFieldValue porosityF  0.40
            volScalarFieldValue porosityF0 0.40
            volScalarFieldValue Ts         800
            volScalarFieldValue T          800
        );
    }

    // Layer 3 — top: densest packing
    boxToCell
    {
        box (0 0 0.064) (0.04 0.018 0.096);
        fieldValues
        (
            volScalarFieldValue porosityF  0.30
            volScalarFieldValue porosityF0 0.30
            volScalarFieldValue Ts         800
            volScalarFieldValue T          800
        );
    }
);

// ************************************************************************* //
